code/Request/INIRQ/OPO-ReadByPartialKey.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://request.message.otherPartyObject.mdm.it.hp.com">
    <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>hpit:w-mdcp-mdm-itg</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">1jtqneqyA#</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <req:OtherPartyObjectReadByPartialKeyRequest>
         <OtherPartyObjectPartialKeyList>
            <!--1 or more repetitions:-->
            <OtherPartyObjectPartialKey>
               <OtherPartyObjectTypeCode>?</OtherPartyObjectTypeCode>
               <SystemAssetId>?</SystemAssetId>
               <!--Optional:-->
               <OtherPartyObjectBusinessRelationshipId>?</OtherPartyObjectBusinessRelationshipId>
               <!--Optional:-->
               <OtherPartyObjectBusinessRelationshipItem>
                  <BusinessRelationshipId>?</BusinessRelationshipId>
                  <BusinessRelationshipItemSequenceNr>?</BusinessRelationshipItemSequenceNr>
               </OtherPartyObjectBusinessRelationshipItem>
               <!--Optional:-->
               <OtherPartyObjectOrganizationId>?</OtherPartyObjectOrganizationId>
               <!--Optional:-->
               <OtherPartyObjectOtherPartySiteId>?</OtherPartyObjectOtherPartySiteId>
               <!--Optional:-->
               <OtherPartyObjectOtherPartySiteInstanceId>?</OtherPartyObjectOtherPartySiteInstanceId>
               <!--Optional:-->
               <OtherPartyObjectSystemAssetUId>?</OtherPartyObjectSystemAssetUId>
            </OtherPartyObjectPartialKey>
         </OtherPartyObjectPartialKeyList>
      </req:OtherPartyObjectReadByPartialKeyRequest>
   </soapenv:Body>
</soapenv:Envelope>